

win_x, win_y = 800, 600
win_width, win_height = 400, 100

txt_hello = 'Добро пожаловать в программу по определению состояния здоровья!'
txt_next = 'Начать'
txt_instruction = 'Данное приложение позволит вам с помощью теста Руфье провести первичную диагностику вашего здоровья. \nПроба Руфье представляет собой нагрузочный комплекс, предназначенный для оценки работоспособности сердца при физической нагрузке. \nУ испытуемого находящегося в положении лежа на спине в течение 5 мин, определяют частоту пульса за 15 секунд; \nзатем в течение 45 секунд испытуемый выполняет 30 приседаний. \nПосле окончания нагрузки испытуемый ложится, и у него выновь подсчитывается число пульсаций за первые 15 секунд, \nа потом - за последние 15 секунд первой минуты периода восстановления. \nВажно! Если в процессе проведения испытания вы почувствуете себя плохо (появится головокружение, шум в ушах, \nсильная одышка и др.), то тест необходимо прервать и обратиться к врачу.' 

#2 окно
txt_title = 'Здоровье'
#Labels
txt_name = 'Введите Ф.И.О'
txt_age = 'Введите сколько вам лет(полных)'
txt_test1 = 'Лягте на спину...'
txt_test2 = 'Выполните 30 приседанией за 45 секунд'
txt_test3 = 'Лягте на спину и замерьте пульс...'
#LineEdits
txt_hintname = 'Ф.И.О'
txt_hintage = '0'
txt_hinttest1 = '0'
txt_hinttest2 = '0'
txt_hinttest3 = '0'
#Pushbuttons
txt_sendresults = 'Отправить результаты'
txt_starttest1 = 'Начать первый тест'
txt_starttest2 = 'Начать делать приседания'
txt_starttest3 = 'Начать последний тест'

#3 окно
txt_finalwin = 'Индекс Руфье: '
txt_index = 'test35'
txt_workheart = 'Работоспособность сердца:'
text_res1 = ' низкий. Срочно обратитесь к врачу'
text_res2 = ' удовлетворительный. Обратитесь к врачу!'
text_res3 = ' средний. Возможно, стоит дополнительно обследоваться у врача.'
text_res4 = ' выше среднего'
text_res5 = ' высокая'

